Repository: esraaabdrabo/trainee
Catalog: lib/l10n/intl_*.arb
Languages: ar

# errorOccurred
source: Error Occured ðŸ˜¢
ar: حدث خطأ ما 😢

# reportError
source: An error has been occurred, please click send to help us fixing the problem
ar: حدث خطأ ما، الرجاء الضغط على إرسال لمساعدتنا بحل المشكلة

source: Unauthorized
ar: غير مخول لك بالوصول

# generalErrorMessage
source: An error has occurred. Please try again later
ar: حدث خطأ ما. يرجى المحاولة لاحقاً

source: Bad Request
ar: إرسال خاطئ

source: Forbidden
ar: لا يمكن الوصول الآن

# notFound
source: {url} not Found
ar: لم يتم إيجاد الصفحة المطلوبة {url}

source: Conflict Error
ar: حدث خطأ في المعلومات

source: Connection time out
ar: انتهت مدة الجلسة

# unknownError
source: Unknown error occurred, please try again
ar: حدث خطأ غير معروف، الرجاء إعادة المحاولة

# internalServerErrorMessage
source: The server encountered an internal error or misconfigurtion and was unable to complete your request.
ar: واجه الخادم خطأ أو تهيئة خاطئة ولم يتمكن من إكمال طلبك سيتم إصلاح المشكلة في أقرب وقت.

# connectionErrorMessage
source: Please check your internet connection
ar: يرجى التحقق من الاتصال بالإنترنت

# oopsErrorMessage
source: OOPS !
ar: أوبس !

# failedRefresher
source: Failed to get data
ar: فشل في جلب البيانات

# noDataRefresher
source: No data
ar: لم يعد يوجد بيانات

# errorTxt
source: This field can't be empty
ar: لا يمكن أن يكون هذا الحقل فارغ

source: Logout
ar: تسجيل الخروج

source: Change Language
ar: تغيير اللغة

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

# changeLangMessage
source: Select a language, the application will restart
ar: اختر اللغة، ستتم إعادة تشغيل التطبيق

source: Login
ar: تسجيل الدخول

source: Welcome
ar: هلا بيك

source: Press twice to exit
ar: إضفط مرتين للخروج

source: User name
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: Confirm password
ar: تأكيد كلمة المرور

# invalidPhoneNumber
source: Please enter a valid phone number ex: 09xx-xxx-xxx
ar: يرجى إدخال رقم هاتف صالح مثال 09xx-xxx-xxx

# invalidPassword
source: Must be at least 5 characters long
ar: يجب أن تكون بطول 5 محارف على الأق

source: Retry
ar: إعادة المحاولة

source: Close App
ar: إغلاق التطبيق

# updateTitle
source: Update Required
ar: التحديث مطلوب

# updateMessage
source: For the best experience, update to the latest version to get new features and improvements.
ar: للحصول على أفضل تجربة ممكنة، يرجى تحديث التطبيق للتمتع بآخر الميزات

source: Empty
ar: لا يوجد معلومات لعرضها

source: Close
ar: إغلاق

# pageEmpty
source: The page has no content ..
ar: لا يوجد محتوى لعرضه ..

source: Refresh
ar: تحديث

source: Apply
ar: تغيير

# responseError
source: An error happened while connecting to server, please try again later
ar: حدث خطأ أثناء الاتصال بالخادم ، يرجى المحاولة لاحقًا

# errorCancelToken
source: The connection has been interrupted
ar: تمت مفاطعة الاتصال

source: Signup
ar: إنشاء حساب جديد

source: Or
ar: أو

# phone
source: Phone Number
ar: رقم الجوال

source: Ok
ar: موافق

source: Confirm Password
ar: تأكيد كلمة المرور

# invalidConfirmPassword
source: Password and confirm password doesn't match
ar: كلمة السر وتأكيد كلمة السر غير متطابقتين

source: First Name
ar: الاسم الأول

source: Last Name
ar: الأسم الأخير

# errorEmptyField
source: This field mustn't be empty
ar: لا يمكن لهذا الحقل أن يكون فارغاً

source: Switch theme
ar: تغيير وضع الالوان

# accountNotVerifiedErrorMessage
source: Account Not Verified
ar: لم يتم التحقق من الحساب

# cancelErrorMessage
source: Operation has been cancelled
ar: تم إلغاء العملية

source: login Error Required
ar: تسجيل الدخول مطلوب

# emptyScreen
source: This page is empty
ar: هذه الصفحة فارغة

source: Send
ar: إرسال

# homePage
source: Home
ar: الرئيسية

source: Translation Test
ar: اختبار الترجمة

source: Just Log
ar: السجل

source: Test Success Request
ar: اختبار طلب ناجح

source: Test Failure Request
ar: اختبار طلب فاشل

source: Test Validator Request
ar: اختبار طلب تحقق

source: Get People
ar: الأشخاص

source: Get Pokemons
ar: البوكيمونات

# testErrorScreen
source: Test Error Handler
ar: اختبار كاشف الأخطاء

# keep_fitness
source: Keep your fitness
ar: حافظ على لياقتك

# intro1_text
source: We are here to help you keep your fitness effectively and simply with suitable prices
ar: نحن هنا للمساعدة في الحفاظ على نشاطك بطريقة فعالة بسيطة بأسعار مناسبة

# lookup_coach
source: lookup your favorite coach
ar: ابحث عن مدربك المفضل

# intro2_text
source: we provide you with the best coaches around the world
ar: نحن نقدم لك أفضل المدربين المعتمدين حول العالم

source: Training daily
ar: تدريب كل يوم

# intro3_text
source: loosing weight and building muscles through training and diet
ar: فقدان الوزن وبناء العضلات من خلال التدريب واتباع الحمية الغذائية

source: next
ar: التالي

source: Skip
ar: تخطي

source: Forgot password?
ar: نسيت كلمة المرور

# no_account
source: don't have an account?
ar: ليس لديك حساب.

source: Search
ar: استكشف

source: Mail
ar: البريد

source: More
ar: المزيد

source: Profile
ar: الشخصية

source: Sport Coaches
ar: مدربين رياضيين

source: Gyms
ar: نوادي رياضية

source: Restaurants
ar: المطاعم

source: Healthy Restaurants
ar: مطاعم صحية

source: Stores
ar: متاجر مكملات

source: See all
ar: إظهار الكل

source: Categories
ar: التصنيفات

source: Food Supplements
ar: مكملات غذائية

source: Most Rated Coaches
ar: المدربين الأفضل تقييماً

# account_exist
source: you have an account
ar: لديك حساب

# login2
source: Login
ar: تسجيل دخول

# signup2
source: Signup
ar: أنشئ حساب جديد

source: Accept on
ar: أوافق على

# terms
source: Terms of service
ar: الشروط والأحكام

# verification_code_sent
source: Verification code has been sent to your mobile
ar: تم إرسال رمز التحقق إلى رقمك الجوال

# insert_verification_code
source: Please insert the Verification code to verify yout account
ar: الرجاء ادخل رمز التحقق لتأكيد حسابك

# account_verification
source: verify account
ar: تأكيد الحساب

source: verify
ar: تأكيد

# no_code_received
source: didn't receive the code?
ar: لم يصلك الرمز؟

source: Resend code
ar: إعادة إرسال الرمز

source: New password
ar: كلمة المرور الجديدة

source: Save
ar: حفظ

source: Men
ar: رجال

source: Women
ar: نساء

source: Coaches
ar: المدربين

# search_coach
source: Search for coach
ar: تبي مدرب محدد؟

source: Courses
ar: الكورسات

source: Book now
ar: احجز الآن

source: Saudi riyal
ar: ريال سعودي

source: Coach location
ar: موقع المدرب

source: Rating Average
ar: متوسط التقييمات

source: Rate now
ar: قيم الآن

source: Subscribe
ar: اشترك

source: Course Subscription
ar: الاشتراك بالكورس

source: Subscription type
ar: نوع الاشتراك

source: Weekly Hours
ar: عدد الساعات بالأسبوع

source: Hour
ar: ساعة

source: Bill
ar: الفاتورة

# payment_way
source: Way of Payment
ar: طريقة الدفع

source: Pay
ar: دفع

# whats_ur_rating
source: What is your rating?
ar: ما هو تقييمك؟

# whats_ur_opinion
source: What is your opinion?
ar: ما هو رأيك؟

source: Current Courses
ar: كورساتي الحالية

source: Ended Courses
ar: كورساتي المنتهية

# payment_ways
source: Payment Methods
ar: طرق الدفع

source: Edit profile
ar: تعديل الصفحة الشخصية

source: Full name
ar: الاسم الكامل

source: Gender
ar: الجنس

source: Date of birth
ar: تاريخ الميلاد

source: Weight
ar: الوزن

source: Height
ar: الطول

source: Enter phone number
ar: أدخل رقم الجوال

# enter_valid_phone
source: enter valid phone number
ar: أدخل رقم جوال صحيح

source: Enter password
ar: أدخل كلمة المرور

# enter_valid_password
source: Enter password of 8 characters or more
ar: أدخل كلمة مرور من 8 محارف أو اكثر

source: Enter confirm password
ar: أدخل كلمة المرور مرة اخرى

# passwords_not_match
source: passwords don't match
ar: عدم تطابق

source: Enter pin code
ar: أدخل رمز التحقق

# accept_terms_conditions
source: Accept terms and conditions
ar: اقبل الشروط والأحكام

# account_created_successfully
source: Registered successfully
ar: تم إنشاء الحساب بنجاح

source: Password changed successfully
ar: تم تعديل كلمة المرور بنجاح

source: Account verified successfully
ar: تم تأكيد الحساب بنجاح

source: Go to
ar: اتجه إلى

source: Account settings
ar: إعدادات الحساب

source: App settings
ar: إعدادات التطبيق

source: Change password
ar: تغيير كلمة المرور

source: Dishes
ar: الأطباق

source: Supplements Shops
ar: متاجر المكملات

source: Supplements
ar: المكملات

source: My orders
ar: طلباتي

source: language
ar: اللغة

source: Arabic
ar: عربية

source: English
ar: انكليزية

source: Privacy policy
ar: سياسة الخصوصية

source: Feedback
ar: تقديم بلاغ

source: About app
ar: عن التطبيق

source: Enable notifications
ar: تفعيل الإشعارات

# insert_value
source: Please insert a value
ar: الرجاء إدخال قيمة

source: Subject
ar: الموضوع

source: Details
ar: التفاصيل

source: No data found
ar: لا يوجد معلومات

source: Filter by
ar: التصفية حسب

# coach_rate
source: Coach's Rate
ar: تقييم المدرب

source: Most rated
ar: الأكثر تقييماً

source: Least rated
ar: الأقل تقييماً

source: Coach address
ar: مكان المدرب

source: Nearest
ar: الأقرب إلي

source: Farthest
ar: الأبعد

source: Coach Specialization
ar: اختصاص المدرب

source: Apply Filter
ar: تطبيق التصفية

source: current_password
ar: كلمة المرور الحالية

# password_changed
source: Password Changed Successfully
ar: تم تغيير كلمة المرور

# image_not_available
source: Image is not available!
ar: الصورة غير متوفرة!

# video_not_available
source: Video is not available!
ar: الفيديو غير متوفر!

source: My Course Details
ar: تفاصيل كورساتي

# course_statistic
source: Course Statistics
ar: أحصائيات الكورس

# coach
source: Coach Name
ar: المدرب

# hoursNumber
source: Course Hours
ar: عدد ساعات الكورس

# finishedHour
source: Finished Hours
ar: الساعات المنجزه

# remainsHours
source: remaining Hours
ar: الساعات المتبقيه

# numberOfAbsenece
source: Absence Days
ar: عدد مرات الغياب

# newpass_cannotbe_as_old
source: The new password can not be same as the old one
ar: كلمة المرور الجديدة لا يمكن ان تكون مثل القديمة

source: Male
ar: ذكر

source: Female
ar: أنثى

# select_your_location
source: Select your location on the map
ar: اختر موقعك على الخريطة

# invalid_email
source: Invalid Email Format
ar: البريد الالكتروني غير صالح

# enter_num_only
source: Enter only numbers
ar: أدخل أرقام فقط

source: Add to cart
ar: أضف إلى السلة

source: quantity
ar: الكمية

# delever_price
source: delivery price
ar: سعر التوصيل

# no_delever
source: no delivery
ar: بدون توصيل

source: total price
ar: السعر الإجمالي

source: Cart
ar: السلة

# add_another_plate
source: Add another dish?
ar: أضافة وجبات أخري ؟

# num
source: Number
ar: عدد

source: Order
ar: اطلب

source: Add another product?
ar: اضافة منتج اخر؟

source: Chat
ar: الرسائل

source: Current Location
ar: موقعك الحالي
